{
    "bot": {
        "prefix": ".",
        "avatar": "./assets/logo.png",
        "checkInterval": {
            "short": 10000,
            "long": 90000
        }
    },

    "colors": {
        "default": "#4286f4",
        "warn": "#ffe200",
        "kick": "#ff6b61",
        "log": "#4a64d6",
        "success": "#1fc622",
        "error": "#db2c23",
        "blacklist": "#000000",
        "mute": "#8100eb",
        "ban": "#cc3300",
        "hardban": "#000000"
    },

    "moderation": {
        "banChannelPrefix": "b-",
        "warnLimitBeforeBan": 2,
        "warnBanReason": "2 avertissements (automatique)",
        "warnBanTime": 345600,
        "warnDuration": 2592000,
        "purgeLimit": 100,
        "maxForumModDuration": 172800
    },

    "music": {
        "queueLimit": 10,
        "canUseMusicCommandsIfNotInChannel": false,
        "shouldAskPermissionForSomeCommands": true
    },

    "apis": {
        "addons": "https://api.skripttools.net/v4/addons/",
        "syntax": "https://skripthub.net/api/v1",
        "server": "https://api.mcsrvstat.us/2/",
        "mojang_api": "https://api.mojang.com",
        "skin": "http://cravatar.eu/helmavatar/",
        "github": "https://api.github.com",
        "rssContentFeeds": ["https://skript-mc.fr/forum/forum/4-annonces.xml/", "https://skript-mc.fr/forum/forum/8-tutoriels.xml/", "https://skript-mc.fr/forum/forum/20-algorithmes.xml/", "https://skript-mc.fr/forum/forum/21-fonctions.xml/", "https://skript-mc.fr/forum/forum/22-fragments-de-code.xml/", "https://skript-mc.fr/forum/forum/6-demandes-de-skripts.xml/", "https://skript-mc.fr/forum/forum/7-aide.xml/"],
        "rssFilesFeed": "https://skript-mc.fr/forum/files/files.xml/"
    },

    "miscellaneous": {
        "maxPollDuration": 604800000,
        "cmdPerPagesInHelp": 5,
        "commandSimilarity": 0.7,
        "documentation": "https://skript-mc.github.io/Swan/"
    },

    "messages": {
        "miscellaneous": {
            "hardBanAutomatic": "Déconnexion du Discord lors d'un banissement",
            "noCategory": "Aucune catégorie",
            "noDocLink": "Calme-toi, petit garnement. Si la documentation de Skript-MC est incomplète, demande l'accès en écriture (Vengelis ou Rémi) afin d'améliorer la documentation.",
            "noSpam": "Merci d'éviter les messages inutiles dans le salon des snippets. Ton message ne contient aucun bloc de code... Comment veux-tu partager ton script sans bloc de code ? Si tu ne sais pas comment faire, regarde ici : <https://support.discordapp.com/hc/fr/articles/210298617>.",
            "cmdSuggestion": "La commande `%c` n'existe pas. Voulais-tu dire `.%m` ?\n*Pour exécuter cette commande, clique sur la réaction ci-dessous.*",
            "musicAskOthers": "%u voudrait effectuer l'action suivante : `%s`. Êtes-vous d'accord ? (ajoutez une réaction au message). Expire au bout d'1 minute.\n**(%d)**",
            "ghostping": ":warning: %s, tu as été ghost-ping par %m. :innocent:",
            "ghostpingPlural": ":warning: %s, vous avez été ghost-ping par %m. :innocent:",
            "sanctionExpired": "Sanction expirée (automatique)",
            "sanctionNotification": "Bonjour %u, tu viens de recevoir une sanction (%s) sur le serveur Skript-MC. Raison : \"%r\". Durée : %d. Nous t'invitons donc a revoir ton comportement pour éviter que cela se reproduise.",
            "sanctionNotificationUpdate": "Bonjour %u, ta sanction sanction (%s) sur le serveur Skript-MC à été mise à jour. Raison : \"%r\". Durée : %d.",
            "sanctionNotificationRemoved": "Bonjour %u, ta sanction (%s) sur le serveur Skript-MC à été révoquée. Raison : \"%r\". Nous t'invitons a revoir ton comportement pour éviter que cela se reproduise.",
            "inactivityWhileBanned": "Inactivité après un bannissement",
            "renameList": [
                "Quiche",
                "Licorne",
                "Tarte",
                "Arachnoïde",
                "Boulet",
                "Banjo",
                "Saperlipopette",
                "Bizu",
                "Tarentule"
            ],
            "strangeName": "Bienvenue sur le serveur Discord de Skript-MC !\nVu que ton pseudonyme contenait des caractères spéciaux, je me suis permis de te les retirer ou de te renommer complètement. J'espère que mes modifications te plairont.\nSi malheureusement ce n'est pas le cas, tu peux demander à un Modérateur Discord (pseudonymes vert clair) pour être renommé."
        },
        "errors": {
            "permission": "Aïe, tu n'as pas les privilèges d'exécuter cette commande. :confused:",
            "notInHelpChannels": "Désolé, tu ne peux pas exécuter cette commande dans les salons d'aide, rends-toi dans le salon #bot. :wink:",
            "erroroccured": "Oups ! Une erreur s'est produite... Merci de réessayer plus tard !",
            "unknowncommand": "Aïe, cette commande n'existe pas...\nEssaye `.help` pour afficher la liste des commandes disponibles. :wink:",
            "privatemessage": "Oups ! Je ne peux pas t'envoyer mes messages privés ! Vérifie qu'ils sont activés sur ce serveur et que tu ne m'aies pas bloqué.",
            "cantplaymusic": "Impossible de jouer cette musique, désolé. :confused:",
            "cooldown": "Oulà, pas si vite ! Réessaie d'exécuter cette commande dans quelques instants. :exploding_head:",
            "rolePermissions": "Impossible d'ajouter/enlever le rôle ! (Problème de permission ou de configuration, pas de Swan)",
            "channelPermissions": ":warning: Impossible de créer ou de modifier le canal privé ! (Problème de permission ou de configuration, pas de Swan)",
            "noReasonSpecified": "Aucune raison spécifiée",
            "music": [
                "Tu n'es pas dans un salon vocal !",
                "Je ne suis pas dans un salon vocal !",
                "Tu n'es pas dans mon salon vocal !",
                "Je ne joue aucune musique !",
                "La queue est vide !",
                "Impossible d'exécuter cette action, tu as une restriction des commandes musicales !"
            ],
            "joinErrors": {
                "notInChannel": "Tu n'es pas dans un salon vocal, rejoins-en un !",
                "restrictedChannel": "Je ne peux pas te rejoindre dans ce salon !",
                "channelFull": "Ce salon est plein, il n'y a pas de place pour moi !",
                "notSpeakable": "Je ne peux pas parler dans ce salon !",
                "notJoinable": "Je ne peux pas rejoindre ce salon !"
            }
        },
        "commands": {
            "togglerolenotification": {
                "help": "Ajouter ou retirer le rôle des Notifications Évènements.",
                "description": "Ajoute ou retire le rôle Notifications Évènements afin d'être notifié lors d'un message lié aux concours."
            },
            "automaticmessages": {
                "help": "Envoyer un message prédéfini.",
                "description": "Envoie un message prédéfini parmis ceux-là : `%s`. Merci de ne pas abuser de cette commande, et de l'exécuter seulement si besoin.",
                "invalidMessage": "Désolé, mais ce message n'existe pas. :confused:",
                "noArg": "Envoie un message prédéfini parmis ceux-là :\n `%s`. Merci de ne pas abuser de cette commande.",
                "cmdSuggestion": "Le message `%c` n'a pas été trouvé. Voulais-tu dire `.automsg %m` ?\n*Pour exécuter cette commande, clique sur la réaction ci-dessous.*",
                "similarity": 0.8,
                "messages": {
                    "asktoask": {
                        "templates": ["asktoask", "ask to ask"],
                        "content": "Afin de vous faire gagner du temps ainsi qu'aux autres membres de ce Discord, merci de poser directement votre question ici. Si quelqu'un est en mesure de vous aider, il vous aidera ! Afin de vous aider au mieux, n'oubliez pas de respecter les modèles de présentation, épinglés dans les salons d'aide. :wink:"
                    },
                    "helptemplate": {
                        "templates": ["helptemplate", "help template"],
                        "content": "Afin que les membres de ce Discord vous aident au mieux, merci de respecter ce modèle de demande d'aide :\n\n__Ma version Skript__ (`/ver skript`) : <ma version>\n__Ma version Minecraft__ (`/ver`) : <ma version>\n__Mes addons__ (`/plugins`) :  <mes plugins>\n__Mon problème__ : <décrivez clairement votre problème>\n__Mon code:__\n```<insérez la partie du code avec le problème>```\nSi votre code dépasse les 2 000 caractères, vous pouvez utiliser un hastebin: <https://hastebin.com>.\nPensez à expliquer de manière précise et courte votre problème, il donnera beaucoup plus envie aux membres de venir vous aider ! :smiley:"
                    },
                    "internalerror": {
                        "templates": ["internal", "internalerror", "internal error"],
                        "content": "Une `internal error` veut simplement dire qu'il y a eu une erreur Java. L'erreur est affichée dans la console. Il n'y a jamais de moyen prédéfini d'en régler une, car ça peut être n'importe quelle erreur Java."
                    },
                    "deprecated": {
                        "templates": ["deprecated", "oldaddon", "old addon"],
                        "content": "Les addons suivants sont vieux et abandonnés par leur(s) développeur(s). Ce qui signifie qu'**ils ne sont plus mis à jour** : ils sont donc **buggés**, **dépréciés** et peuvent être **nuisibles** à votre serveur. Nous vous conseillons d'éviter de les utiliser. Voici la liste des principaux addons dépréciés (faites `.addon-info <addon>` pour en savoir plus) :\nBiosphere, ExtraSk, LargeSk, PirateSk et PirateSk2, RandomSk, SkAction, SkellettProxy, SkExtras, SkQuery, SkRambled, Umbaska et WildSkript."
                    },
                    "gui": {
                        "templates": ["gui"],
                        "content": "Il fortement déconseillé d'utiliser les GUI de SkQuery, utilisez plutôt les GUI de Skript ou de TuSKe. Vos codes seront plus **optimisés**, **plus rapides pour l'utilisateur**, **plus simple à coder**, **plus complets** et **moins buggés**. Pour connaître plus de détails sur la différence entre les GUI SkQuery et TuSKe, faites `.auto gui-pv`.",
                        "pvContent": [
                            "S'il vous plaît, n'utilisez pas les GUIs de SkQuery. Préférez utiliser les GUIs de TuSKe ou de Skript (oui c'est possible !). Il y a une multitude de raisons à cela :\n**__1 : Rapidité d'éxecution__**\nQuand vous ouvrez un inventaire avec TuSKe, pas besoin de mettre des wait, ni besoin de mettre wait entre chaque ajout d'item ; alors qu'il faut mettre un wait après l'ouverture d'un GUI SkQuery, et qu'il est conseillé d'en mettre un entre chaque ajout d'item. Donc votre GUI s'ouvrira plus rapidement avec TuSKe.\n\n**__2 : Rapidité de code__**\nPour ajouter plusieurs items similaires avec SkQuery, il faut copier coller la ligne. Alors qu'avec TuSKe, vous pouvez simplement spécifier plusieurs slots, tel que : ```vb\nformat gui slot 0, 1, 2, 3, 4 and 5 of player with 1 dirt named \"test\" with lore \"c'est un lore...\"```\n\n**__3 : Fonctionnalités supplémentaires__**\nTuSKe possède beaucoup plus de fonctionnalités que SkQuery. Par exemple, pour éxecuter plusieurs effets en même temps lorsqu'on clic sur un item, il faut créer une fonction ou une subroutine puis l'appeler. Avec TuSKe, vous pouvez juste faire ceci :```vb\nformat gui slot 0 of player with 1 dirt to run:\n\tmessage \"plusieurs\"\n\tmessage \"effets à la suite\"\n\tmessage \"et on peut en ajouter autant qu'on veut ;)\"```",
                            "Il y a aussi la possibilité de gérer rapidement les types de clic. Avec SkQuery, obligé de passer par un \"on inventory click\". Avec TuSKe, vous pouvez le faire directement lors de la mise en place de l'item, et ajouter plusieurs clics différents pour un seul item, comme ceci : ```vb\n\nformat gui slot 0 of player with 1 dirt to run with right click:\n\tmessage \"éxecuté avec un clic droit\"\nformat gui slot 0 of player with 1 dirt to run with left click:\n\tmessage \"éxecuté avec un clic gauche\"```Aussi, dans TuSKe vous pouvez unformat un slot : `unformat gui slot %numbers% of %players%` ou `unformat all gui slots of %players%`, ou encore savoir si le joueur est dans un GUI : `%player% has a gui`, et plein d'autre encore.\n\n**__4 : Beaucoup moins bugué__**\nC'est un fait : SkQuery présente énormément de bug pour les GUIs. Par exemple, avec SkQuery, ce code vous enverra toujours 10 lorsque vous clicrez sur l'item : ```vb\nset {_s} to 0\nloop 10 times:\n\tformat slot {_s} of player with 1 dirt to run [message \"%{_s}%\"]\n\tadd 1 to {_s}```Alors que tout fonctionne avec TuSke.\nAussi, si l'on met unstealable à un slot dans le GUI, le slot situé à la même position dans l'inventaire du joueur sera aussi imprenable. Enfin, SkQuery présente un bug visuel quand on spamclick. Dans certains cas il est même possible d'arriver à recevoir l'item. Embêtant non ?\n\n:arrow_right_hook: **__Pour conclure :__** n'utilisez pas SkQuery pour vos GUIs, vos codes seront moins lent, plus simple, plus complets et moins bugués.\n\nPar ailleurs, dans certaines versions assez récente de Minecraft 1.15, peut être même 1.14 dans certains cas, TuSKe ne fonctionne pas. Étant donné qu'il n'est pas maintenu, il est déprécié *dans ces versions*. Ce n'est en aucun cas une excuse pour repasser à SkQuery, mais plutôt pour utiliser les GUIs vanilla de Skript qui sont peut-être un peu plus longs à apprendre mais ne nécéssitent pas d'addon, ne présentent aucun bug et sont tout aussi efficaces."
                        ]
                    },
                    "everyloop": {
                        "templates": ["everyloop", "every loop"],
                        "content": "```applescript\nevery X:\n\tloop all players:\n\t\t# Votre code </>```Les codes de ce type sont fortements déconseillés pour des questions d'**optimisation** et de **performance**. Imaginez que tous les ticks (20 fois par seconde) ou autre délai, vous vérifiez tous les joueurs de votre serveur ? Cela reste correct si vous êtes 4, mais si vous êtes une trentaine ? Skript ferait 120 000 vérifications par minute si vous êtes une centaine, votre serveur ne supporterait pas tous ces calculs !\n\nEssayez de trouver une alternative à votre code, qui n'utilise pas ce type de code. Si jamais cela est vraiment obligatoire, alors vous pouvez envisager d'utiliser quelque chose comme cela :```applescript\non join:\n\twhile player is online: # Tant que le joueur est en ligne, fais les instructions suivantes:\n\t\t# Votre code </>\n\t\twait 5 seconds # Déconseillé de le réduire```Même si ce n'est pas une solution miracle, c'est une solution préférable à la précédente, car plutôt que vérifier tous les joueurs tous les X temps, chaque joueur possède sa boucle qui se rafraîchit tous les X.\n\n:arrow_right_hook: **__Pour conclure :__** D'une manière générale, essayez d'éviter le plus possible les `every X:` ou les `on any move:` dans vos codes, essayez d'utiliser des alternatives."
                    },
                    "longcode": {
                        "templates": ["longcode", "long code", "code"],
                        "content": "Si votre code dépasse les 2 000 caractères, il est conseillé d'utiliser un de ces sites : <https://gist.github.com>, <https://hastebin.com> ou <https://pastebin.com>. Sinon, vous pouvez utiliser la commande `.code <code>`. **Rappel :** ne nous envoyez **pas de screen** de votre code !"
                    },
                    "version": {
                        "templates": ["ver", "version"],
                        "content": "Pour connaître la version de votre serveur, utilisez `/version` ou `/ver`. Pour connaître la version d'un plugin, utilisez `/version <nom du plugin>` ou `/ver <nom du plugin>`."
                    },
                    "list": {
                        "templates": ["list", "liste"],
                        "content": "Il est plus que fortement conseillé d'utiliser des **variables listes** dans vos codes, plutôt que de simples variables à point (`.`). Les raisons sont multiples : **convention**, **optimisation**, **facilité de certaines tâches**... Pour en savoir plus, faites `.auto list-pv`.",
                        "pvContent": ["Pourquoi utiliser des listes plutôt que des variables ?\n\n**Simplicité :** Il est beaucoup plus compliqué de modifier plusieurs valeurs d'un coup avec de simples variables. Prenons l'exemple de cette variable : {joueurs.%player%} Dans cet exemple, pour supprimer nos valeurs nous sommes obligé de loop tout les joueurs, ce qui peut prendre très longtemps selon le nombre de joueur connecté sur votre serveur :```vb\nloop all players:\n\tclear {joueurs.%loop-player%}```Nous ne pouvons pas non plus utiliser des index ou loop notre variable ce qui peut être problématique dans certains cas d'utilisation. Voici donc l'alternative à ces problèmes : {joueurs::%player%}\nLa différence entre les deux variables est simple mais pas des moindres : elle a été transformée en liste. C'est-à-dire que plutôt d'avoir une variable par joueur, il y a une variable, qui stocke tous les joueurs. Cela nous permet de pouvoir loop notre variable, par exemple\n```vb\nloop {joueur::*}:\n\tbroadcast \"Il s'agit du joueur n°%loop-index% nommé %loop-value%\"```\n\n**Rapidité :** Pour certaines raisons internes, il est plus optimisé d'utiliser des variables listes plutôt que de simples variables même pour stocker une seule valeur. Par exemple, il est toujours préférable d'utiliser une variable du type `{variable::nombre-fixe}` plutôt que `{variable.nombre-fixe}`."]
                    },
                    "command§": {
                        "templates": ["§", "command§", "uselesscommand", "useless command", "commandfunction", "command function"],
                        "content": "Il est extrêmement déconseillé d'utiliser des commandes préfixées d'un `§`, utilisez plutôt une fonction. Plusieures raisons à cela :\n\n- D'abord, une fonction est faite pour ça. Cela sera donc plus optimisé. Pour savoir comment utiliser les fonctions, regardez ici : <http://bit.ly/30lSOBL> et là : <http://bit.ly/2Xv2oWd>.\n\n- Ne pensez pas que vous ne risquez rien. Il sera toujours possible d'utiliser le caractère `§` dans Minecraft via des mods, des glitchs ou autre. Cela peut vraiment nuire à votre serveur, surtout si des fonctionnalitées importantes reposent sur ce genre de système.\n\n- Cela rend votre code brouillon. Vous utilisez des techniques inadaptées, et par conséquent défectueuses. Votre code ne s'en portera que mieux si vous utilisez les fonctions."
                    },
                    "1.8": {
                        "templates": ["1.8", "1.8.x", "1.8.X", "18"],
                        "content": "La 1.8.X et les versions antérieures ne sont pas et ne seront jamais supportées par la fork de bensku (la fork Skript la plus utilisée).\nPour utiliser Skript dans ces versions, vous pouvez toutefois utiliser une version plus vieille de Skript. Par exemple, pour la 1.8.X, vous pouvez essayer d'utiliser :\n- la 2.2-dev27 (<https://github.com/bensku/Skript/releases/tag/dev27>)\n- la 2.2-dev36 (<https://github.com/bensku/Skript/releases/tag/dev36>)\n\nPour les versions 1.7.X et antérieures, vous pouvez essayer d'utiliser ces versions : <https://dev.bukkit.org/projects/skript/files>.\nIl existe aussi une version non-officielle qui est pour le moment activement mise à jour avec les dernières fonctionnalitées de la fork de bensku, et qui est disponible ici : <https://github.com/Matocolotoe/Skript-1.8/releases>."
                    },
                    "contains": {
                        "templates": ["contain", "contains"],
                        "content": "Avant la version 2.4 de Skript, il est recommandé de ne pas utiliser la condition `contains`, et ce pour plusieurs raisons :\nD'abord, `contains` ne fonctionne pas toujours. Ce problème a déjà été signalé plusieurs fois : souvent, alors qu'un élement se trouve bien dans la liste, `contains` renvoie quand même faux.\nEnsuite, cette condition est exceptionnelement lente. En effet, dans une liste de 3000 élements, utiliser `contains` prend 600ms (plus d'une demie-seconde !) à s'éxecuter, alors qu'utiliser la fonction suivante, ayant la même utilité, prend 3ms ! Fonction : ```vb\nfunction listContains(list: objects, o: object) :: boolean:\n\tloop {_list::*}:\n\t\tif loop-value is {_o}:\n\t\t\treturn true\n\treturn false```\n\nIl est donc préférable d'utiliser la fonction ci-dessus pour rechercher parmis une liste. Utilisation : `listContains({maliste::*}, {_maValeur})`."
                    },
                    "paperspigot": {
                        "templates": ["paperspigot", "paper", "spigot"],
                        "content": "Il est recommandé d'utiliser **PaperSpigot** plutôt que Spigot, pour plusieurs raisons. Avant tout sachez que ce n'est qu'une fork (une reprise) de Spigot, donc Paper fonctionnera très bien avec tous vos plugins actuels, pas besoin de les remplacer ou de les reconfigurer. Ensuite, il est activement, voire même plus souvent mis à jour que Spigot avec des bugfixes et des améliorations. Voici pourquoi vous devrez le préférer :\n- PaperSpigot est plus performant que Spigot ;\n- Si vous êtes développeur Java, il vous permettra d'accéder à plus de fonctionnalités, car son API est plus complète ;\n- Justement, les développeurs de Skript s'en servent, donc si vous utiliser PaperSpigot, vous aurez accès à encore plus de syntaxe Skript (ex: `on jump` ...).\n\nVous pouvez le télécharger ici : <https://papermc.io/downloads>."
                    },
                    "recrutement": {
                        "templates": ["recrutement", "recruting"],
                        "content": ":warning: Merci de ne pas faire vos demandes de recrutement sur le Discord.\nPour cela, vous pouvez aller dans cette catégorie du forum : <https://skript-mc.fr/forum/forum/14-recrutement-pour-vos-projets/>. Votre demande sera plus fructueuse que sur Discord."
                    },
                    "spoonfeed": {
                        "templates": ["spoonfeed", "learntolearn", "searchdoc"],
                        "content": ":warning: Nous déconseillons de donner un code prêt à être copié-collé, __sans que l'utilisateur n'ait compris son contenu__ (= **spoonfeed**, anglais pour `nourrir à la cuillère`).\nAfin de favoriser l'apprentissage à Skript et dans le but de devenir autonome, nous demandons aux utilisateurs d'essayer de réaliser leur code **eux-même** avec l'aide des nombreuses documentations qui existent afin qu'ils comprennent ce qu'ils font.\n\n:arrow_right_hook: Néanmoins, nous restons bien entendu toujours présents pour vous aider lorsque vous ne trouvez pas les réponses à vos questions !"
                    },
                    "encoding": {
                        "templates": ["encoding", "utf-8", "utf8"],
                        "content": "Pour encoder vos scripts, vous pouvez utiliser l'encodage `UTF-8`.\nCet encodage permettra à Skript de lire correctement vos fichiers.\n\n:small_blue_diamond: **NotePad++** : `Encodage` > `Encoder en UTF-8` :white_check_mark: \n:small_blue_diamond: **Visual Studio Code** : `Status Bar (en bas)` > `UTF-8` :white_check_mark:\n:small_blue_diamond: **Sublime Text 3** : `File` > `Save with encoding` > `UTF-8` :white_check_mark:"
                    },
                    "pattern": {
                        "templates": ["pattern", "skriptpattern"],
                        "content": "Comment utiliser une syntaxe Skript ? Elles sont en réalité extrêmement simples. Voici comment elles sont composées :\n- `[...]` : optionnel\n- `(1|2|3)` : une des propositions (`1`, `2` ou `3`) est obligatoire\n\nSi vous avez toujours besoin d'aide concernant ces syntaxes, prenons comme exemple celle-ci : `[the] (clicked (block|%itemtype/entitydata%)|clicked slot|clicked inventory|click (type|action)|inventory action)`. Pour obtenir la liste des possibilités, vous pouvez accéder à <https://bi0qaw.github.io/skript-pattern-calculator>."
                    }
                }
            },
            "8ball": {
                "help": "Répond par Oui ou Non à une question que vous lui posez.",
                "description": "Réponse personnalisée par Oui ou Non à une n'importe quelle question ! Réponse sûre garantie à 7%.",
                "noQuestion": "Je ne suis pas devin, ajoute une question !",
                "affirmative": [
                    "Oui.",
                    "Oui ! 🥳",
                    "D'après moi, oui !",
                    "Je le pense...",
                    "C'est une chose sûre ! 😌",
                    "C'est certain.",
                    "Sans aucun doute ! 😁",
                    "Il me semble...",
                    "Pourquoi demander ? La réponse parait évidente ! Oui !",
                    "ET C'EST UN OUI !",
                    "Oui ! NAN J'AI PERDU 😭\nJe suis vraiment nul au ni-oui ni-non... 😫",
                    "Affirmatif, chef.",
                    "Positif."
                ],
                "negative": [
                    "Non.",
                    "MDR NON",
                    "C'est un non.",
                    "Mes sources me confirment que non. 🙂",
                    "C'est mieux que tu ne sois pas au courant... 😏",
                    "Bien sur que non ! 😱",
                    "Je ne suis pas sûr de comprendre...\nDans le doute, je vais dire non. 😅",
                    "Question très compliquée...\nMais je dirai non. 😶",
                    "Ou... Non ! C'est Non !",
                    "Bien sur que non...",
                    "Négatif.",
                    "Je répondrai par la négation. Rah chui trop fort à ni-oui ni-non !\nTu ne me battras jamais. 😉",
                    "Sûrement pas."
                ]
            },
            "errordetails": {
                "help": "Aide à régler les erreurs de vos scripts",
                "description": "Aide à régler les erreurs que vous pouvez avoir lorsque vous faites /sk reload. Attention, cette commande est en BETA, donc le pourcentage de précision n'est pas garanti à 100%. Il se peut aussi que certaines erreur ne soit pas disponibles.",
                "noError": "Tu n'as pas défini d'erreur !",
                "error": {
                    "indentation": "Ce message apparait généralement lorsqu'il y a une incohérence dans les tabulations. Il peut y avoir plusieurs cas de figure pour que cette erreur apparaisse :\n\n- Lorsque vous utilisez un mélange d'espaces et de tabulation. Dans ces cas la, enlevez tous les espaces/tabulations de la ligne, et refaite-les. Cela peut aussi arriver lorsque vous copier collez le code de quelqu'un alors qu'il ne l'a pas formatté dans des blocs de codes (Discord ou forum), et que des caractères spéciaux bizarres et invisibles se sont introduits.\n\n- Cela peut aussi arriver lorsque il manque une tabulation, comme dans ce cas : ```applescript\nif {_variable} is equal to 3:\n\tif {player::%player%} is set:\n\tmessage \"Bravo !\"```**Rappel :** lorsqu'une ligne se *finit* par un \":\", la ligne suivante est *toujours* indenté d'un cran de plus.\n\n- Dernier cas de figure, directement en relation avec le précédent : la ligne précédente ne finit pas par un \":\" alors qu'elle devrait, comme dans ce cas de figure :```applescript\nif {_variable} is equal to 3:\n\tif {player::%player%} is set\n\tmessage \"Bravo !\" # Vous n'avez pas indenté car la ligne précédente ne finit pas par \":\", alors qu'elle est censé.```Corriger un problème d'oubli de \":\" à la fin d'une ligne peut corriger plusieurs erreurs d'un coups.",
                    "cantunderstand": "Ce message apparait généralement lorsque Skript ne reconnait pas la syntaxe que vous avez entré. Il peut y avoir plusieurs cas de figure pour que cette erreur apparaisse:\n\n- Il peut manquer un \":\" à la fin de la ligne\n\n- La syntaxe a été ajouté par un addon ou par Skript, mais elle n'existe pas dans la version que vous avez. Pensez à toujours garder vos addons et Skript à jour.\n\n- La syntaxe vient d'un addon que vous n'avez pas installé. Pour savoir quel addon nécessite une syntaxe, utilisez la commande `.doc <syntaxe>`\n\n- Vous vous êtes trompé dans la ligne, par exemple vous avez mal orthographié des mots ou vous en avez oublié/rajouté. Pour connaîter le pattern exacte d'une syntaxe, utilisez la commande `.doc <syntaxe>`.",
                    "emptysection": "Ce message apparait généralement lorsqu'il vous manque des tabulations après une ligne qui finit par un \":\", comme dans cet exemple : ```vb\nif {_variable} is 3:\n\tif {player::%player%} is set:\n\tmesage \"bravo\"\n\tmessage\"T'es le meilleur\"``` Pour régler ce problème, ajoutez simplement des tabulations aux ligne que vous vouliez indenter.",
                    "invalidquotes": "Ce message apparait généralement lorsqu'il y a une incohérence dans les guillements (\"). Ce la peut arriver dans plusieurs cas :\n\n- Lorsque vous voulez utiliser des guillemets dans un texte, sans les doubler, comme dans cet exemple : ```vb\non join:\n\tmessage \"Bienvenue au \"grand\" %player%\"```Pour utiliser des guillemets dans du texte, doublez-les, tel que : `message \"Bienvenue au \"\"grand\"\" %player%\"`. Cela fonctionnera.\n\n- Lorsque vous avez oublié un guillement en fin de ligne, tel que `message \"Bonjour`",
                    "noloopmatch": "Ce message indique que la loop que vous avez sélectionné  n'est pas compatible avec le loop-* que vous avez spécifié. Par exemple, la loop `loop 10 times:` n'est pas compatib le avec le `loop-player` ou le `loop-index`",
                    "elseafterif": "Ce message apparait généralement lorsque vous avez un `else` ou un `else if` sans `if` avant, ou alors avec un `if` mais qui n'est pas reconnu. Il est conseillé de corriger en dernier cette erreur car généralement elle découle d'un autre problème. Si c'est la seule erreur que vous avez, alors vérifiez que vous avez bien un `if` avant.",
                    "cantcompare": "Ce message signifie que vous essayez de comparer deux types de données différents , qui ne peuvent pas être comparés. Par exemple, vous ne pouvez pas comparer `loop-entity` avec `\"Toto\"` ( une entité avec un texte )",
                    "cantbeadded": "Cette erreur se produit quand tu essayes d'ajouter une valeur un type de données non supportée à une expression ( par exemple `add \"aaa\" to players` causera cette erreur , car l'expression `players` n'est pas faite pour qu'on lui ajoute une donnée de type texte",
                    "noplayer": "Cette erreur signifie que dans votre code, vous utilisez un joueur, alors que l'évènement n'en contient pas. Par exemple, dans un `on join:`, il y a bien un joueur concerné. Mais dans un `every minute:`, ou dans une fonction, il n'y a pas de joueur. Pour remédier a cela, vous pouvez donc utiliser un `loop all players:`, même si rappelez-vous qu'un `every X: loop all players:` n'est pas conseillé. Pour en savoir plus : .automsg everyloop",
                    "codeintriggers": "Cette erreur peut survenir si une ligne n'a aucune indentation, tel que ceci : ```vb\non join:\nmessage \"Bonjour\" # Cette ligne va générer un \"all code has to be put in triggers\"```",
                    "cantloopsinglevalue": "Cette erreur peut arriver lorsque vous essayer de faire une boucle sur une variable qui n'est pas une variable liste par exemple. Vérifiez donc que vous essayez de loop une expression/variable contenant plusieurs valeurs",
                    "unknown": "Désolé, mais je ne connais pas cette erreur... Beaucoup d'autre erreur existe dans Skript. Pour vous aider a corriger votre erreur, essayez déjà de la traduire, cela vous aidera à mieux comprendre votre problème. Si vous ne voyez toujours pas, et que vous n'avez pas pu trouver de sujets similaires résolus sur internet, alors vous pouvez demander de l'aide dans les canaux d'aide."
                }
            },
            "addoninfo": {
                "help": "Envoyer diverses informations sur un addon.",
                "description": "Envoie diverses informations sur un addon, telles que son auteur, sa dernière version, un lien de téléchargement, si l'addon est déprecié, les dépendances...",
                "addonDoesntExist": "Désolé, mais il est impossible d'accéder à cet addon. Es-tu sur qu'il est disponible sur [skripttools](<https://skripttools.net/addons?q=%s>) ?",
                "invalidCmd": "Il faut que tu ajoutes le nom d'un addon ! Vérifie qu'il soit disponible sur [skripttools](<https://skripttools.net/>) et orthographie-le de la même manière. Les majuscules n'importent pas.",
                "searching": "Je vais chercher ça...",
                "searchResults": "%r élements trouvés pour la recherche `%s`. Quel addon vous intéresse ?\n:warning: **Attendez que la réaction :x: soit ajoutée avant de commencer.**",
                "cmdSuggestion": "L'addon %c n'a pas été trouvé. Voulais-tu dire `.addoninfo %m` ?",
                "similarity": 0.9,
                "embed": {
                    "author": ":bust_in_silhouette: Auteur(s)",
                    "version": ":gear: Dernière version",
                    "download": ":inbox_tray: Lien de téléchargement",
                    "sourcecode": ":computer: Code source",
                    "depend": ":link: Dépendences obligatoires",
                    "softdepend": ":link: Dépendences facultatives",
                    "unmaintained": ":warning: Addon abandonné",
                    "unmaintained_desc": "Cet addon a été abandonné par son auteur ! Il est fortement déconseillé de l'utiliser."
                }
            },
            "skriptinfo": {
                "help": "Envoyer diverses informations sur Skript.",
                "description": "Envoie diverses informations sur Skript, telles que sa version actuelle, un lien de téléchargement, les versions de Skript à utiliser selon la version Minecraft...",
                "invalidCmd": "Il faut que tu ajoutes le nom d'un menu (`download`, `links`) !",
                "embed": {
                    "author": ":bust_in_silhouette: Auteur(s)",
                    "version": ":gear: Dernière version",
                    "verInfo": "Information sur les versions de Skript",
                    "verInfo_desc": ":black_small_square: Skript requiert Spigot pour fonctionner. Il ne fonctionnera donc pas avec Bukkit. Il est cependant conseillé d'utiliser PaperSpigot, car il vous permettera d'utiliser plus de fonctionnalitées de Skript.\n\n:black_small_square: La dernière version de Skript ne supporte que les dernières versions de Minecraft, de la 1.9 à la 1.15. Cela veut dire que la 1.12.2 est supportée, mais pas la 1.12 par exemple (même si elle a de fortes chances de fonctionner).\n\n:black_small_square: Pour utiliser Skript dans ces versions, vous pouvez toutefois utiliser une version plus vieille de Skript. Par exemple, pour la 1.8.X, vous pouvez essayer d'utiliser la [2.2-dev27](<https://github.com/bensku/Skript/releases/tag/dev27>) ou la [2.2-dev36](<https://github.com/bensku/Skript/releases/tag/dev36>).\n\nPour les versions 1.7.X et antérieures, vous pouvez essayer d'utiliser [une de ces versions](<https://dev.bukkit.org/projects/skript/files>).\n\nIl existe aussi une version non-officielle qui est pour le moment activement mise à jour avec les dernières fonctionnalitées de la fork de bensku, et qui est disponible [ici](<https://github.com/Matocolotoe/Skript-1.8/releases>).\n\n:black_small_square: Les dernières versions de Minecraft seront supportées le plus vite possible.",
                    "download": ":inbox_tray: Liens de téléchargement",
                    "sourcecode": ":computer: Code source"
                }
            },
            "syntaxinfo": {
                "enabled": false,
                "help": "Envoyer diverses informations sur une syntaxe.",
                "description": "Envoie diverses informations sur une syntaxe, telle que l'addon nécessaire, le pattern, un exemple... Vous devez chercher une syntaxe avec des mots clés qui seront cherchés dans le nom ou la description. Vous pouvez ensuite affiner vos recherche un spécifiant un addon, un type ou une ID skripthub.",
                "syntaxDoesntExist": "Aucune syntaxe ne correspond a votre recherche... Nous avons pourtant essayer de rechercher dans le titre et dans la description... Désolé.",
                "invalidCmd": "Il faut que tu ajoutes le nom d'une syntaxe !",
                "embed": {
                    "patternTitle": ":pencil: Pattern",
                    "patternDesc": "```vb\n%s\n```",
                    "noPattern": "Aucun pattern disponible.",
                    "descriptionTitle": ":bookmark_tabs: Description",
                    "noDescription": "Aucune description disponible",
                    "infos": ":information_source: Informations diverses",
                    "exampleTitle": ":bulb: Exemple",
                    "exampleDesc": "```vb\n%s\n```"
                }
            },
            "serverinfo": {
                "help": "Afficher des informations sur un serveur Minecraft.",
                "description": "Envoie diverses informations sur un certain serveur Minecraft, selon son IP.",
                "invalidCmd": "Il faut que tu ajoutes un serveur !",
                "searching": "Je vais chercher ça...",
                "noServerFound": "Aucun serveur ne correspond à votre requête !",
                "embed": {
                    "status": "Statut",
                    "ip": "Adresse IP",
                    "players": "Joueurs",
                    "version": "Version",
                    "hostname": "Nom d'hôte",
                    "software": "Software",
                    "plugins": "Plugins",
                    "mods": "Mods"
                }
            },
            "playerinfo": {
                "help": "Afficher des informations sur un joueur Minecraft.",
                "description": "Envoie diverses informations sur un certain joueur, que vous avez défini par son pseudo Minecraft.",
                "playerNotFound": "Impossible de trouver ce joueur, désolé.",
                "invalidCmd": "Il faut que tu ajoutes un pseudo !",
                "searching1": "Je vais chercher ça... (1/2)",
                "searching2": "Je vais chercher ça... (2/2)",
                "error": "Une erreur est survenue, désolé.",
                "noHistory": "Cet utilisateur n'a jamais changé de pseudo !",
                "embed": {
                    "pseudo": "Pseudo actuel",
                    "history": "Historique"
                }
            },
            "userinfo": {
                "help": "Afficher des informations sur un membre.",
                "description": "Envoie diverses informations sur un certain membre du Discord Skript-MC, que vous avez défini par son ID ou en le mentionnant (Merci d'éviter de mentionner. Pour récupérer l'ID de quelqu'un, activez le mode développeur (Paramètres > Apparence > Avancé > Mode développeur), puis faites un clic-droit sur son pseudo > Copier l'Identifiant).",
                "invalidCmd": "Vous avez oublié de spécifier un utilisateur ! Vous pouvez soit le mentionner (déconseillé), soit mettre son ID.",
                "pseudoNotFound": "Ce membre n'existe pas ou n'est pas sur ce Discord !",
                "embed": {
                    "joined": "❯ A rejoint le serveur",
                    "created": "❯ A créé son compte",
                    "roles": "❯ Rôles",
                    "names": "❯ Noms",
                    "presence": "❯ Présence"
                }
            },
            "help": {
                "help": "Afficher la page d'aide.",
                "description": "Envoie la page d'aide de toutes les commandes de Swan, ou donne des informations sur une commande spécifique.",
                "cmdDoesntExist": "Aucune commande ne correspond a votre recherche...  Désolé.",
                "cmdSuggestion": "La commande `%c` n'existe pas. Voulais-tu dire `%m` ?",
                "header": "Les syntaxes des commandes se lisent comme un pattern Skript. Les commandes avec un :octagonal_sign: sont des commandes de modération. Pour avoir plus d'information sur une commande : `.help <commande>`.",
                "searchResults": "%r élements trouvés pour la recherche `%s`. Quelle commande vous intéresse ?\n:warning: **Attendez que la réaction :x: soit ajoutée avant de commencer.**",
                "details": {
                    "everyone": "Tout le monde.",
                    "noExample": "Aucun exemple disponible.",
                    "all": "Tous",
                    "description": "**Description :**",
                    "category": "**Catégorie :**",
                    "utilisation": "**Utilisation :**",
                    "aliases": "**Alias :**",
                    "examples": "**Exemple(s) d'utilisation :**",
                    "usable": "**Utilisable par :**",
                    "channels": "**Salons :**"
                }
            },
            "links": {
                "help": "Envoie plusieurs liens importants relatifs à Skript.",
                "description": "Envoie plusieurs liens importants relatifs à Skript, tels que des documentations, des forums, des liens de téléchargement, des Discords...",
                "embed": {
                    "summary": "Voici la liste des liens importants relatifs à Skript. Sommaire :\n:zero: Sommaire\n:one: Liens sur les documentations de Skript\n:two: Liens sur les documentations des addons de Skript\n:three: Liens de téléchargement de Skript et de ses addons\n:four: Liens vers quelques Discord importants\n:five: Divers liens importants",
                    "docSkSkMc_title": ":books: Documentation Skript de SkriptMC : https://bit.ly/2KSZ6pN",
                    "docSkSkMc_desc": "Documentation sur Skript, faite par la communauté de Skript-MC. Elle est en français et elle est en constante amélioration. Si vous avez une suggestion, ou si vous voyez une erreur, n'hésitez pas à nous en faire part !",
                    "docSkOffi_title": ":books: Documentation Skript officielle : https://bit.ly/2VUGZ3W",
                    "docSkOffi_desc": "Documentation de Skript officielle. Elle est en anglais mais est complète. Elle contient toutes les syntaxes utilisables dans la dernière version de Skript.",
                    "docAddSkMc_title": ":books: Documentation addons de SkriptMC : https://bit.ly/2viSqq8",
                    "docAddSkMc_desc": "Documentation des addons, faite par la communauté de Skript-MC. Elle ne contient pas encore tous les addons, mais est en français et elle est complête.",
                    "docAdd_title": ":books: Documentation des addons : https://bit.ly/2UTSlJ6",
                    "docAdd_desc": "Documentation officielle de tous les addons. Elle est en anglais, mais contient la quasi-totalité des addons disponibles.",
                    "dlSk_title": ":inbox_tray: Téléchargement de Skript : https://bit.ly/2TMxYNm",
                    "dlSk_desc": "Lien pour télécharger la dernière version de Skript officielle. La dernière version de Skript en date ne supporte que les dernières versions de Minecraft de la 1.9 à la 1.13 inclus. Cela veut dire que la 1.12.1 n'est pas supportée, mais la 1.12.2 l'est.",
                    "dlAdd_title": ":inbox_tray: Téléchargement des addons : https://bit.ly/2XvahGH",
                    "dlAdd_desc": "Lien de téléchargement des dernières versions de tous les addons existant pour Skript.",
                    "discSkMc_title": ":speech_left: Discord Skript-MC : https://discordapp.com/invite/J3NSGaE",
                    "discSkMc_desc": "Lien officiel de ce Discord.",
                    "discSkCh_title": ":speech_left: Discord Skript Chat : https://discord.gg/V4qFVnh",
                    "discSkCh_desc": "Lien du Discord \"Skript Chat\", qui est le Discord officiel de Skript. Vous pourrez y demander de l'aide en anglais, que ce soit sur Skript ou sur des addons.",
                    "forumSkMc_title": ":speech_balloon: Forum SkriptMC : https://skript-mc.fr",
                    "forumSkMc_desc": "Forum français de Skript-MC. Vous pourrez y demander des Skript, de l'aide Skript, Java ou avec vos serveurs, discuter avec des membres de la communauté ou mettre en ligne vos skript !",
                    "gitSk_title": ":computer: GitHub de Skript : https://bit.ly/2W0EJrU",
                    "gitSk_desc": "GitHub officiel de la fork Skript de Bensku. C'est actuellement la seule fork de Skript toujours mise à jour."
                }
            },
            "poll": {
                "help": "Lancer un sondage.",
                "description": "Lance un sondage temporaire par lequel on peut répondre par Oui / Non ou par une réponse personnalisée.",
                "invalidDuration": "La durée marquée est invalide !",
                "invalidCmd": "Il y a un problème dans ta commande... Vérifie qu'elle soit construite de cette façon :\n```.sond <durée> \"<sondage>\" [\"réponse 1\"] [\"réponse 2\"] [\"réponse 3\"] ...```\n**DURÉE** est composée d'un nombre suivi sans espace de `sec` pour `seconde` ou de `m` pour `minute` ou de `h` pour `heure` ou de `j` pour `jour`.\n**SONDAGE** est un texte, entre guillemets, qui explique votre sondage.\n**[\"réponse X\"]** est une option de réponse, entre guillemets. Ce champ est facultatif, car si vous ne mettez aucune réponse on devra répondre à votre sondage par Oui/Non.\nExemple de commande : ```.sond 1h30m \"Vous aimez les pâtes ?\"```",
                "quoteProblem": "Il y a un problème dans les guillemets (\") !",
                "notEnoughAnswers": "Il n'y a pas assez de réponses possible ! Il faut préciser soit aucune réponse, auquel cas on pourra répondre a ton sondage par oui et non, soit au moins 2 réponses.",
                "tooManyAnswers": "Il y a trop de réponse ! Le maximum est de 18.",
                "pollInfosYesNo": "**Informations sur les sondages :**\nRéagissez par :white_check_mark: pour voter Oui à la question posée, ou réagissez par :x: pour voter Non. Au bout du temps défini, le décompte des votes est fait. Si vous enlevez votre réaction, elle sera tout de même comptée. Si vous mettez plusieurs réactions, c'est la 1ère mise qui sera comptée. Le vote commence lorsque l'embed devient bleu. Pour arrêter un vote, cliquez sur :octagonal_sign:.",
                "pollInfosCustom": "**Informations sur les sondages :**\nRéagissez par :one:, :two:, :three: etc pour voter pour la réponse qui vous convient. Au bout du temps défini, le décompte des votes est fait. Si vous enlevez votre réaction, elle sera tout de même comptée. Si vous mettez plusieurs réactions, c'est la 1ère mise qui sera comptée. Le vote commence lorsque l'embed devient bleu. Pour arrêter un vote, cliquez sur :octagonal_sign:.",
                "tooLong": "Désolé, mais la durée indiquée pour ce sondage est trop longue. Le maximum autorisé est de 7 jours."
            },
            "joke": {
                "help": "Envoyer une blague aléatoire.",
                "description": "Envoie aléatoirement une blague drôle (ou pas).",
                "alreadyLiked": "Tu as déjà rigolé devant cette blague. :smile:",
                "alreadyDisliked": "Tu m'as déjà dit que cette blague était nulle. :rolling_eyes:",
                "liked": "Cette blague est à mourir de rire, n'est-ce pas ? :smile:",
                "disliked": "Je suis d'accord avec toi, cette blague est nulle ! :rolling_eyes:",
                "jokes": [
                    "Un mec rentre dans un café.;Et plouf !",
                    "Pourquoi les crocos sont en prison ?;Car les crocos dealent !",
                    "Quelle mamie fait peur aux voleurs ?;Mamie Traillette !",
                    "Quel est l'aliment le plus hilarant ?;Le riz !",
                    "Pourquoi est-ce que le lapin est bleu ?;Parce qu’on lapin !",
                    "D'où viennent les gens les plus dangereux ?;D’Angers !",
                    "Comment est-ce que les abeilles communiquent entre elles ?;Par e-miel !",
                    "Quel est l'arbre préféré des chômeurs ?;Le bouleau !",
                    "Pourquoi est-ce que les moutons aiment le chewing-gum?;Parce que c’est bon pour la laine !",
                    "Que dit une noisette quand elle tombe à l'eau ?;« Je me noix ! »",
                    "Quel fruit est assez fort pour couper des arbres?;Le ci-tron",
                    "Quel est le jambon que tout le monde déteste ?;Le sale ami !",
                    "C'est l'histoire d'un papier qui tombe à l'eau.;Il crie « Au secours, j'ai pas pied ! »",
                    "Que fait une fraise sur un cheval ?;Tagada Tagada !",
                    "Tu connais la blague de la chaise ?;Elle est tellement longue !",
                    "Tu connais l'histoire de la chaise ?;Elle est pliante !",
                    "Comment appelle-t-on une catapulte à salade ?;Un lance-roquette !",
                    "Comment appelle-t-on une bagarre entre une carotte et un petits pois ?;Un bon duel !",
                    "Tu connais l'histoire du lit vertical ?;Elle est à dormir debout !",
                    "Tu veux une blague à deux balles ?;Pan ! Pan !",
                    "C'est l'histoire d'un Schtroumpfs qui court, qui court... Et il tombe.;Il s'est fait un bleu !",
                    "Tu connais la blague du p'tit déj' ?;Pas de bol !",
                    "Tu connais la blague de l'armoire ?;Elle est pas commode !",
                    "Quel super héros donne le plus vite l'heure ?;Speed heure man !",
                    "La vitamine C ne dira rien.;Mais elle le sais !",
                    "Que veux dire « I don’t know » ?;« Je sais pas »",
                    "Quelle est la femelle du hamster ?;L'Amsterdam !",
                    "Que dit un oignon quand il se cogne ?;Aïe !",
                    "Quel est le comble pour un marin ?;Avoir le nez qui coule !",
                    "Quel est le sport le plus silencieux ?;Le para-chuuuut !",
                    "Pourquoi ne faut-il jamais raconter d'histoires drôles à un ballon ?;Parce qu'il pourrait éclater (de rire) !",
                    "Quel est l'animal le plus à la mode ?;La taupe modèle !",
                    "Comment appelle t-on une fleur qui prend sa graine à moitié ?;Une migraine !",
                    "J'ai fait une blague au magasin;Mais elle a pas supermarché !",
                    "Pourquoi est-ce si difficile de conduire dans le Nord ?;Parce que les voitures arrêtent pas de caler !",
                    "Qu'est-ce qu'un tennisman adore faire ?;Rendre des services !",
                    "Pourquoi est-ce que les livres ont-ils toujours chaud ?;Parce qu'ils ont une couverture !",
                    "Que se passe-t-il quand 2 poissons s'énervent ?;Le thon monte !",
                    "Que dit une imprimante dans l'eau ?;J'ai papier !",
                    "Pourquoi est-ce que les bières sont toujours stressées ?;Parce qu'elles ont la pression !",
                    "Pourquoi est-ce que les éoliennes n'ont pas de copain ?;Parce qu’elles se prennent toujours des vents !",
                    "Qu'est ce qu'un cadeau qui s'en va ?;Une surprise party !",
                    "Comment savoir qu'un rat est content ?;Il souris !",
                    "Que fait un geek quand il a peur ?;Il URL !",
                    "Qu'est-ce qui est pire que le vent ?;Un vampire !",
                    "Que dit une mère à son fils geek quand le dîner est servi ?;Alt Tab !",
                    "Quelle est la meilleure heure pour écouter de la musique ?;10h !",
                    "Que fait un geek quand il descend du métro ?;Il libère la RAM !",
                    "Quel est l'animal le plus connecté ?;Le porc USB !",
                    "Que fait un jardinier quand il ment ?;Il raconte des salades !",
                    "Quel est le crustacé le plus léger de la mer ?;La palourde !",
                    "Quel est le comble pour un maître nageur ?;Avoir le nez qui coule !",
                    "Qu'est-ce qu'un Cheval de Mer qui a des douleurs musculaires ?;Un hippocrampe !",
                    "Quelle est la monnaie des poissons ?;Les sous-marins !",
                    "Que dit un donuts à la plage ?;Je vais me beignet !",
                    "Pourquoi peut-on dire que le chef d'établissement d'un lycée est un sniper ?;Parce que c'est un proviseur !",
                    "Pourquoi tu fais 20 fois le tour du lycée sans t'arrêter ?;Parce que je poursuis mes études !",
                    "Tu connais l'histoire du lit vertical ?;C'est une histoire à dormir debout !",
                    "Que disent deux planètes dans un parc d'attraction ?;Oulah sa turne !",
                    "Quelle est le comble pour une pomme de terre ?;Qu'elle s'effrite !",
                    "Comment appelle-t-on un chien qui s'y connait en médecine ?;Un dogteur !",
                    "Quel est le sport le plus silencieux ?;Le parachuuuute !",
                    "Comment appelle-t-on un boomerang qui ne revient pas ?;Un bout de bois !",
                    "Si une voiture roule à 70 km/h dans un virage à droite, quelle roue va la moins vite ?;La roue de secours !",
                    "Que mange-t-on à la naissance ?;Du riz cantonais !",
                    "Que dit-on à un poisson mal poli ?;Baisse d'un ton !",
                    "Que fait un vendeur de chaussure qui est curieux ?;Il semelle de tout !",
                    "Pourquoi il n'y a pas de ballon sur le plateau de Questions pour un Champion ?;Parce que Julien Lepers !",
                    "Que fait un matheux quand il va au toilette ?;Il fait pipi !"
                ]
            },
            "ranking": {
                "help": "Consulter les classements.",
                "description": "Envoie les classements des musiques/blagues les plus likées/dislikées/vues.",
                "noType": "Il faut ajouter un type de classement ! Voici les types disponibles : `musique-like`, `musique-dislike`, `musique-views` ou `joke-like`, `joke-dislike`, `joke-views`",
                "invalidType": "Type de classement invalide ! Voici les types disponibles : `musique-like`, `musique-dislike`, `musique-views` ou `joke-like`, `joke-dislike`, `joke-views`"
            },
            "discover": {
                "help": "Découvrir une commande de Swan",
                "description": "Envoie une des nombreuses commandes de Swan afin de les découvrir."
            },
            "status": {
                "help": "Consulter ou définir le statut de Swan.",
                "description": "Consulter le status de Swan, ou de l'activer/désactiver.",
                "turnOn": ":white_check_mark: Vous avez bien activé Swan !",
                "turnOff": ":white_check_mark: Vous avez bien désactivé Swan !",
                "status": "Statut actuel de Swan : %s"
            },
            "tagrole": {
                "help": "Notifier un rôle qui n'est pas mentionnable.",
                "description": "Notifie un rôle qui n'est pas mentionnable.",
                "invalidCmd": "Il faut ajouter un rôle à mentionner !",
                "invalidRole": "Désolé, mais le rôle '%s' est introuvable... Êtes-vous sûr de l'avoir orthographié de la même façon ?"
            },
            "rules": {
                "help": "Afficher les règles des salons d'aide Skript.",
                "description": "Envoie les règles des salons d'aide Skript.",
                "onlyInHelp": "Cette commande est disponible uniquement dans les salons d'aide Skript.",
                "invalidRule": "Le numéro de la règle n'est pas valide !",
                "messages": [
                    "Lorsque vous demandez de l'aide, il faut donner le plus d'informations possibles (votre code, version Skript/addons/minercaft, vos addons, vos erreurs si vous en avez (pensez à regarder la console), etc.).",
                    "Rester clément même avec les débutants. Tout le monde n'est pas un expert en Skript."
                ]
            },
            "ping": {
                "help": "Afficher la latence de Swan",
                "description": "Envoie la latence entre vous et Swan ainsi que Swan et l'API Discord.",
                "firstMessage": ":incoming_envelope: Calcul en cours ...",
                "secondMessage": ":hourglass: Swan: %sms\n\n:globe_with_meridians: API Discord: %xms"
            },
            "mathematiques": {
                "help": "Permet de tester la mathématique de Skript.",
                "description": "Teste une expression mathématique en Skript.",
                "addMath": "Il faut que tu ajoutes une expression mathématique !",
                "error": "Impossible de tester cette expression ! Il semblerait qu'il y ait un problème dedans..."
            },
            "code": {
                "help": "Permet de présenter votre code de façon claire.",
                "description": "Mettre votre code dans un bloc. Ajoutez le paramètre '-l' pour afficher le numéro des lignes.",
                "noCode": "Merci d'ajouter un code ! Il faut que la première ligne soit sur la même ligne que la commande `.code`."
            },
            "statistics": {
                "help": "Envoie diverses statistiques.",
                "description": "Envoie diverses statistiques sur Swan et le serveur."
            },
            "changeconfig": {
                "help": "Modifie la configuration.",
                "description": "Modifier différentes valeurs de la configuration",
                "invalidConfig": "Veuillez indiquer une configuration valide.",
                "emptyValue": "Veuillez indiquer une valeur correcte.",
                "successfullyChanged": "Votre modification a été appliquée."
            },
            "addonpack": {
                "help": "Envoie un pack d'addon correspondant à une certaine version MC.",
                "description": "Envoie un pack d'addon correspondant à une certaine version de Minecraft.\nSi vous connaissez une version plus récente d'un addon fonctionnant dans une certaine version de minecraft, n'hésitez pas a contacter les devs ou à vous rendre sur le Discord de développement (lien disponible dans les messages épinglés de #bot).",
                "invalidVersion": "Ajoute une version de Minecraft valide et récente (1.9+) ! Ex: `1.12.2`, `1.10`, `1.14`...",
                "messages": [
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.9** :\n\nSkript : 2.4.1 ou 2.3.7 ou 2.2-dev37c\nAddons :\n- MundoSK : 1.8.5\n- SkQuery : 3.6.5-Lime\n- SkStuff : 1.6.4.1\n- Skellett : 1.9.6b\n- Tuske : 1.8.3-PikachuPatch-v3\n- SkDragon : 0.15\n- SkRayFall : 1.9.16\n- Skutilities : 0.9.2\n- skript-mirror : 0.19.1",
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.10** :\n\nSkript : 2.4.1 ou 2.3.7 ou 2.2-dev37c\nAddons :\n- MundoSK : 1.8.5\n- SkQuery : 3.6.5-Lime\n- SkStuff : 1.6.4.1\n- Skellett : 1.9.6b\n- Tuske : 1.8.3-PikachuPatch-v3\n- SkDragon : 0.15\n- SkRayFall : 1.9.16\n- Skutilities : 0.9.2\n- skript-mirror : 0.19.1",
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.11** :\n\nSkript : 2.4.1 ou 2.3.7 ou 2.2-dev37c\nAddons :\n- MundoSK : 1.8.5\n- SkQuery : 3.6.5-Lime\n- SkStuff : 1.6.4.1\n- Skellett : 1.9.6b\n- Tuske : 1.8.3-PikachuPatch-v3\n- SkDragon : 0.15\n- SkRayFall : 1.9.16\n- Skutilities : 0.9.2\n- skript-mirror : 0.19.1",
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.12** :\n\nSkript : 2.4.1 ou 2.3.7 ou 2.2-dev37c\nAddons :\n- MundoSK : 1.8.5\n- SkQuery : 3.6.5-Lime\n- Sk-NBeeT : 2.4.1\n- Skellett : 1.9.6b\n- Tuske : 1.8.3-PikachuPatch-v3\n- SkDragon : 0.15\n- SkRayFall : 1.9.16\n- Skutilities : 0.9.2\n- skript-mirror : 0.19.1",
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.13** :\n\nSkript : 2.4.1 ou 2.3.7\nAddons :\n- MundoSK : 1.8.5\n- SkQuery : 3.6.5-Lime\n- Sk-NBeeT : 2.4.1\n- Skellett : 1.9.6b\n- Tuske : 1.8.3-PikachuPatch-v3\n- SkDragon : 0.15\n- SkRayFall : 1.9.16\n- Skutilities : 0.9.2\n- skript-mirror : 0.19.1",
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.14** :\n\nSkript : 2.4.1\nAddons :\n*Liste à venir.*",
                    ":warning: Attention, cette commande est assez vieille et n'est plus vraiment mise à jour. La liste des addons est toujours correcte mais il est possible que certaines versions ne soient plus compatibles, prennez juste la dernière version de l'addon. Version des addons conseillés pour la **1.15** :\n\nSkript : 2.4.1 (ou dernière version Skript 2.5-alpha)\nAddons :\n*Liste à venir.*"
                ]
            },
            "ban": {
                "help": "Appliquer une restriction du Discord à un membre.",
                "description": "Applique une restriction du Discord à un membre.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "missingTimeArgument": "Vous n'avez pas spécifié de durée !",
                "missingReasonArgument": "Vous n'avez pas spécifié de raison !",
                "durationTooLong": "Vous ne pouvez pas appliquer de sanction aussi longue ! Votre maximum est de 2 jours.",
                "unableToSelfBan": "Vous ne pouvez pas vous bannir vous-même !",
                "userTooPowerful": "Désolé, je ne peux rien faire contre cet utilisateur... Toi non plus d'ailleurs !",
                "invalidDuration": "Vous n'avez pas écrit la durée correctement ! Merci d'entrer un nombre suivi (sans espaces) de `sec` (seconde), `m` (minute), `h` (heure), `j` (jour), `mo` (mois) ou simplement `def` (à vie).",
                "successfullyBanned": "Vous avez bien banni %u !\nRaison : %r\nDurée : %d",
                "durationUpdated": "Vous avez bien mis à jour la durée de la restriction du discord de %u : %d.",
                "sanctionUpdated": "Ta sanction a été mise à jour. Tu es maintenant bannis : %d",
                "whyHere": "Bonjour %u. Tu as été banni(e) par les modérateurs. Tu peux essayer de t'expliquer avec eux.\nSi tu quittes ce discord, tu seras banni(e) automatiquement, à vie. Cette conversation est sauvegardée.\n\n**Raison :** %r.\n**Durée :** %d.\n**Expire :** %e.",
                "noReasonSpecified": "Aucune raison spécifiée"
            },
            "unban": {
                "help": "Retirer une restriction du Discord à un membre.",
                "description": "Retire une restriction du Discord à un membre. Ajoutez l'argument `-no-delete` pour ne pas supprimer le salon privé.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "successfullyUnbanned": "Vous avez bien débanni %u !\nRaison : %r",
                "notBanned": "%u n'est pas banni (ou du moins ce n'est pas inscrit dans la base de données).",
                "noReasonSpecified": "Aucune raison spécifiée"
            },
            "mute": {
                "help": "Rendre muet un membre.",
                "description": "Rendre muet un membre dans les salons d'aide.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "missingTimeArgument": "Vous n'avez pas spécifié de durée !",
                "missingReasonArgument": "Vous n'avez pas spécifié de raison !",
                "durationTooLong": "Vous ne pouvez pas appliquer de sanction aussi longue ! Votre maximum est de 2 jours.",
                "noSelfMute": "Vous ne pouvez pas vous rendre muet vous-même !",
                "userTooPowerful": "Désolé, je ne peux rien faire contre cet utilisateur... Toi non plus d'ailleurs !",
                "invalidDuration": "Vous n'avez pas écrit la durée correctement ! Merci d'entrer un nombre suivi (sans espaces) de `sec` (seconde), `m` (minute), `h` (heure), `j` (jour), `mo` (mois) ou simplement `def` (à vie).",
                "successfullyMuted": "Vous avez bien rendu muet %u !\nRaison : %r\nDurée : %d",
                "durationUpdated": "Vous avez bien mis à jour la durée du mute de %u : %d.",
                "noReasonSpecified": "Aucune raison spécifiée"
            },
            "unmute": {
                "help": "Redonner la parole à un membre.",
                "description": "Rétabli la parole à un membre dans les salons d'aide.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "successfullyUnmuted": "Vous avez bien rétabli la parole à %u !\nRaison : %r",
                "notMuted": "%u n'est pas muet (ou du moins ce n'est pas inscrit dans la base de données).",
                "noReasonSpecified": "Aucune raison spécifiée"
            },
            "warn": {
                "help": "Avertir un membre.",
                "description": "Donne un avertissement à un membre.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "missingReasonArgument": "Vous n'avez pas spécifié de raison !",
                "noSelfWarn": "Ne te warn pas toi même, boulet.",
                "userTooPowerful": "Désolé, je ne peux rien faire contre cet utilisateur... Toi non plus d'ailleurs !",
                "successfullyWarned": "Vous avez bien averti %u !\nRaison : %r\nID de l'avertissement : %d",
                "warning": "%u, vous avez été averti par un modérateur pour la raison suivante : %r. Nous t'invitons donc à revoir ton comportement.",
                "noReasonSpecified": "Aucune raison spécifiée",
                "warnLimitReached": "C'est le deuxième avertissement pour ce membre, il a automatiquement été sanctionné."
            },
            "removewarn": {
                "help": "Supprimer un avertissement.",
                "description": "Enlève un avertissement à un membre, selon l'ID de l'avertissement.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "missingIdArgument": "Vous n'avez pas spécifié d'ID de warn *(visible sur l'embed quand on .warn, dans les logs, ou en faisant .history)* !",
                "successfullyUnwarned": "Vous avez bien enlevé l'avertissement `%d` de %u !\nRaison : %r",
                "noReasonSpecified": "Aucune raison spécifiée",
                "alreadyRevoked": "Cet avertissement est déjà révoqué"
            },
            "kick": {
                "help": "Expulser un membre.",
                "description": "Expulse un membre du serveur Discord.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "noSelfKick": "Ne te kick pas toi même, boulet.",
                "userTooPowerful": "Désolé, je ne peux rien faire contre cet utilisateur... Toi non plus d'ailleurs !",
                "successfullyKicked": "Vous avez bien expulsé %u !\nRaison : %r",
                "noReasonSpecified": "Aucune raison spécifiée"
            },
            "history": {
                "help": "Consulter l'historique des sanctions d'un membre.",
                "description": "Envoie l'historique de toutes les sanctions d'un membre.",
                "missingUserArgument": "Vous n'avez pas spécifié d'utilisateur *(mention ou ID)* !\nIl est possible que cet utilisateur ait quitté le serveur.",
                "noHistory": ":x: Ce membre n'a reçu aucune sanction !"
            },
            "idée": {
                "help": "Envoyer une idée de script aléatoire.",
                "description": "Envoie une idée de script aléatoire à réaliser parmis celles dans le salon des idées."
            },
            "movemessage": {
                "help": "Déplacer un message.",
                "description": "Déplace un message vers un salon défini par son identifiant.",
                "invalidChannel": "Désolé, je n'ai pas pu trouver ce salon. Vérifie que tu l'as correctement mentionné (#salon).",
                "sameChannel": "Ce message se trouve déjà dans ce salon, tu ne peux pas le déplacer !",
                "invalidMessage": "Désolé, je n'ai pas pu trouver ce message. Vérifie que tu aies indiqué l'identifiant du message concerné.",
                "restrictedChannel": "Désolé, tu ne peux pas exécuter cette commande ou déplacer ce message dans ce salon.",
                "targetedUserTooPowerful": "Désolé, tu ne peux pas déplacer le message de cet utilisateur.",
                "successfullyMoved": ":twisted_rightwards_arrows: %a, ton message a été déplacé vers %s par %t."
            },
            "purge": {
                "help": "Supprimer des messages dans un salon.",
                "description": "Supprime un nombre de messages determiné dans un salon. La suppresion peut être basée sur un utilisateur en particulier. La limite de suppression est fixée à 100. Par défault, les messages des membres ayant le rôle 'Staff' ne serront pas supprimés, pour aussi les supprimer, utiliser l'argument `-f`",
                "missingNumberArgument": "Vous devez spécifier un nombre de messages à supprimer !",
                "wrongUsage": "Tu dois spécifier un nombre de message à supprimer (accompagné d'un utilisateur pour cibler la suppression) !",
                "tooOld": "Certains messages que vous tentez de supprimer ont été envoyés il y a plus de 14 jours : il m'est impossible de les supprimer."
            },
            "ghostping": {
                "help": "Mentionner un membre, sans laisser de trace.",
                "description": "Mentionne un membre sans laisser aucune trace, en toute discrétion.",
                "missingUserArgument": "Vous devez ajouter un utilisateur à mentionner."
            },
            "play": {
                "help": "Jouer une musique.",
                "description": "Joue une musique ou une playlist selon son nom ou son URL YouTube. Ajoute `--first` pour choisir automatiquement le premier résultat si vous cherchez une musique par son nom.",
                "restrictedUser": "Impossible d'exécuter cette action, tu as une restriction des commandes musicales !",
                "notInChannel": "Tu n'es pas dans un salon vocal !",
                "alreadyBusy": "Désolé, mais je suis déjà occupé dans un autre salon... Rejoins-moi vite dans le salon %s !",
                "noArgumentGiven": "Tu ne m'as donné aucune musique à jouer et la queue est vide !",
                "queueLimited": "Impossible d'ajouter cet élément à la queue car elle est pleine (queue limitée à %d).",
                "playlistNotFound": "La playlist n'a pas été trouvée ! As-tu vérifié qu'elle existe et qu'elle n'est pas répertoriée en privé ?",
                "blacklistedMusic": "Impossible de jouer cette musique car elle a été ajoutée à la liste noire !",
                "blacklistedChannel": "Impossible de jouer cette musique car elle provient d'une chaîne ajoutée à la liste noire !",
                "1ElementCouldntBeAdd": "Désolé, mais 1 élément de la playlist n'a pu être ajouté car il a sûrement été ajouté à la liste noire.",
                "severalElementCouldntBeAdd": "Désolé, mais %s éléments de la playlist n'ont pu être ajoutés car ils ont sûrement été ajoutés à la liste noire.",
                "noLiveStream": "Je ne supporte pas encore les diffusions en direct !",
                "songTooLong": "Je n'accepte que les musiques durant moins d'une heure !",
                "playlistAdded": "Playlist : :musical_note: %s :musical_note: ajoutée à la queue.",
                "songAdded": "Musique : :musical_note: %s :musical_note: ajoutée à la queue. Elle se trouve en position %p.",
                "error": "Une erreur s'est produite... Merci de réessayer plus tard !",
                "chooseSong": "J'ai trouvé plusieurs musiques, choisis une musique en cliquant sur la réaction correspondante :",
                "nowPlaying": "Musique en cours de lecture : :musical_note: %t :musical_note: (%d)",
                "noMusicFound": "Désolé, mais je n'ai trouvé aucune musique correspondante à ta recherche `%s`."
            },
            "queue": {
                "help": "Afficher la queue.",
                "description": "Envoie la liste de toutes les musiques actuellement dans la queue.",
                "invalidIndex": "L'index entré n'est pas valide ! Vérifiez que vous avez saisi un nombre et que la queue contienne cette musique.",
                "removedSong": "Musique %s retirée de la queue !",
                "cleared": "La queue a entièrement été vidée !",
                "startQueue": "Pour lancer la queue, faites simplement `.play`."
            },
            "shuffle": {
                "help": "Mélanger la queue de lecture.",
                "description": "Mélange l'ordre des musiques dans la queue.",
                "queueShuffled": "Ordre de passage des musiques mélangé ! Pour afficher la nouvelle queue, faites `.queue`.",
                "ask": "mélanger la queue"
            },
            "pause": {
                "help": "Pauser ou reprendre la lecture d'une musique.",
                "description": "Pause ou reprend la lecture de la musique actuellement lue.",
                "paused": ":pause_button: Musique mise en pause !",
                "resumed": ":arrow_forward: Musique reprise !",
                "ask": "pause/reprendre la musique"
            },
            "leave": {
                "help": "Déconnecter Swan du salon vocal.",
                "description": "Déconnecte Swan du salon vocal auquel il est connecté.",
                "left": "Je suis bien parti du salon vocal ! À la prochaine. :wink:",
                "ask": "déconnecter Swan du canal vocal"
            },
            "stop": {
                "help": "Arrêter la lecture de la musique.",
                "description": "Arrête la lecture de la musique actuelle.",
                "stopped": "J'ai bien arrêté la musique ! `.play` pour continuer la queue.",
                "ask": "arrêter la musique"
            },
            "skip": {
                "help": "Passer une ou plusieurs musique.",
                "description": "Passe une ou plusieurs musiques de la queue.",
                "invalidIndex": "L'index entré n'est pas valide ! Vérifiez que vous avez saisi un nombre et que la queue contienne cette musique.",
                "skippedOne": "La musique a bien été passée !",
                "skippedSeveral": "J'ai passé %s musiques !",
                "ask": "passer une/plusieurs musique(s)"
            },
            "volume": {
                "help": "Modifier le volume de la musique.",
                "description": "Modifie le volume de la musique. Afin d'éviter de gêner les autres utilisateurs, préférez plutôt baisser le volume de Swan en faisant un `clic-droit` dessus, puis en modifiant le curseur `Volume de l'utilisateur`.",
                "invalidVolume": "Le volume entré n'est pas valide ! Vérifiez que vous avez saisi un nombre compris entre 1 et 10.",
                "currentVolume": "Le volume actuel est à %s/10.",
                "changed": "Le volume a bien été modifié à %v."
            },
            "bassboost": {
                "help": "Modifier la puissance des basses.",
                "description": "Modifie le gain de la musique. La puissance par défault est à 20",
                "invalidPower": "La puissance entrée n'est pas valide ! Vérifiez que vous avez saisi un nombre compris entre 0 et 40.",
                "currentPower": "La puissance actuelle est à %d/40.",
                "changed": "La puissance a bien été modifiée à %d, la modification sera effective dès la prochaine lecture.",
                "ask": "changer la puissance des basses"
            },
            "join": {
                "help": "Connecter Swan dans votre salon vocal.",
                "description": "Connecte le Swan dans votre salon : il ne doit pas être déjà occupé ou être dans votre salon.",
                "comming": "J'arrive dans ton salon vocal !",
                "alreadyBusy": "Désolé, mais je suis déjà occupé dans un autre salon... Rejoins-moi vite dans le salon %s !",
                "alreadyInChannel": "Hé, ouvre les yeux ! Je suis déjà dans ton salon !"
            },
            "nowplaying": {
                "help": "Envoie des informations sur la musique en cours.",
                "description": "Envoie des informations sur la musique en cours.",
                "successfullyReported": "Cette musique a bien été signalée. Les modérateurs pourront ajouter la musique ou la chaîne YouTube d'où elle provient à la liste noire. Si vous abusez de cette fonctionnalité, vous risquez d'être sanctionné.",
                "noSongPlaying": "Aucun musique n'est en cours de lecture et la queue est vide.",
                "alreadyLiked": "Tu as déjà aimé cette musique !",
                "alreadyDisliked": "Tu as déjà dislike cette musique !",
                "liked": "Vous avez bien aimé cette musique ! :thumbsup:",
                "disliked": "Vous avez bien dislike cette musique ! :thumbsdown:",
                "alreadyBlacklist": ":warning: **Cette musique est déjà ajoutée dans la liste noire !**"
            },
            "loop": {
                "help": "Changer le mode de répétition des musiques.",
                "description": "Active ou désactive la répétition d'une musique.",
                "noLooping": "Actuellement, je ne répète pas les musiques ! `.loop on` pour répéter cette musique.",
                "loopingMusic": "Actuellement, je répète la musique que je joue ! `.loop off` pour arrêter la répétition.",
                "disabled": "J'ai bien désactivé la répétition. `.loop on` pour répéter cette musique.",
                "changed": "Je vais répeter cette musique ! `.loop off` pour arrêter la répétition.",
                "alreadyEnabled": "La répétition est déjà activée ! `.loop off` pour répéter une musique.",
                "alreadyDisabled": "La répétition est déjà désactivée ! `.loop on` pour répéter une musique."
            }
        }
    }
}
